Repository: LiveSkin/LiveSkin
Catalog: lib/l10n/app_*.arb
Languages: th

# appTitle
source: Live Skin
th: ผิวมีชีวิต

# welcomeTitle
source: Welcome to the world of Live Skin
th: ยินดีต้อนรับสู่โลกของ ผิวมีชีวิต

# welcomeSubtitle
source: Discover the secrets of anatomy and the influence of clothing on the body
th: ค้นพบความลับของกายวิภาคศาสตร์และอิทธิพลของเสื้อผ้าต่อร่างกาย

source: Anatomy
th: กายวิภาคศาสตร์

# anatomyDescription
source: Study the principles of nerve endings and hair follicles
th: ศึกษาหลักการทำงานของปลายประสาทและขน

source: Wardrobe
th: ตู้เสื้อผ้า

# wardrobeDescription
source: Choose the perfect clothing for your body
th: เลือกเสื้อผ้าที่สมบูรณ์แบบสำหรับร่างกายของคุณ

source: Experiment
th: การทดลอง

# experimentDescription
source: 30-day experiment to strengthen muscles through clothing
th: การทดลอง 30 วันเพื่อเสริมความแข็งแรงของกล้ามเนื้อผ่านเสื้อผ้า

source: Profile
th: โปรไฟล์

# profileDescription
source: Your data and progress
th: ข้อมูลและความก้าวหน้าของคุณ

source: Settings
th: การตั้งค่า

source: Language
th: ภาษา

source: Theme
th: ธีม

source: Dark Mode
th: โหมดมืด

source: Light Mode
th: โหมดสว่าง

source: System Theme
th: ธีมระบบ

source: About
th: เกี่ยวกับ

source: Version
th: เวอร์ชัน

source: Back
th: กลับ

source: Save
th: บันทึก

source: Cancel
th: ยกเลิก

source: OK
th: ตกลง

source: Error
th: ข้อผิดพลาด

source: Success
th: สำเร็จ

source: Loading...
th: กำลังโหลด...

# noData
source: No data available
th: ไม่มีข้อมูล

source: Retry
th: ลองใหม่

source: Close
th: ปิด

# anatomyStep1Title
source: Body Hair
th: ขนร่างกาย

# anatomyStep1Description
source: The human body has millions of hairs. Each hair has a bulb and roots.
th: ร่างกายมนุษย์มีขนนับล้านเส้น แต่ละเส้นมีหัวและราก

# anatomyStep2Title
source: Nerve Endings
th: ปลายประสาท

# anatomyStep2Description
source: Millions of nerve endings run through the body, connected to the roots of DIFFERENT bulbs.
th: ปลายประสาทนับล้านเส้นวิ่งผ่านร่างกาย เชื่อมต่อกับรากของหัวที่แตกต่างกัน

# anatomyStep3Title
source: Hologram
th: โฮโลแกรม

# anatomyStep3Description
source: The brain receives a hologram with a 3D model of what the body is placed in.
th: สมองรับโฮโลแกรมพร้อมโมเดล 3D ของสิ่งที่ร่างกายสวมใส่

# anatomyStep4Title
source: Body Adaptation
th: การปรับตัวของร่างกาย

# anatomyStep4Description
source: The brain adjusts the anatomy of the body (physical shell) to fit the clothing.
th: สมองปรับกายวิภาคของร่างกาย (เปลือกทางกายภาพ) ให้เข้ากับเสื้อผ้า

# anatomyStep5Title
source: Examples
th: ตัวอย่าง

# anatomyStep5Description
source: Watermelon in a cube → cubic watermelon Foot in tight shoes → deformed foot
th: แตงโมในกล่องสี่เหลี่ยม → แตงโมสี่เหลี่ยม เท้าในรองเท้าคับ → เท้าบิดเบี้ยว

# comfortMode
source: Comfort
th: สบาย

# correctionMode
source: Correction
th: แก้ไข

# allBodyParts
source: All
th: ทั้งหมด

# topClothing
source: Top
th: บน

# bottomClothing
source: Bottom
th: ล่าง

source: Comfort Level
th: ระดับความสบาย

source: Correction Level
th: ระดับการแก้ไข

source: Loose T-shirt
th: เสื้อยืดหลวม

# looseTshirtDescription
source: Soft cotton fabric, doesn't restrict movement
th: ผ้าฝ้ายนุ่ม ไม่จำกัดการเคลื่อนไหว

# looseJeans
source: Loose Fit Jeans
th: กางเกงยีนส์หลวม

# looseJeansDescription
source: Comfortable fit, doesn't press on stomach
th: พอดีสบาย ไม่กดท้อง

source: Sports Shorts
th: กางเกงขาสั้นกีฬา

# sportsShortsDescription
source: Maximum freedom of movement
th: อิสระในการเคลื่อนไหวสูงสุด

source: Cotton Shirt
th: เสื้อผ้าฝ้าย

# cottonShirtDescription
source: Breathable fabric, classic cut
th: ผ้าที่ระบายอากาศได้ ตัดแบบคลาสสิก

# compressionTank
source: Compression Tank Top
th: เสื้อกล้ามกด

# compressionTankDescription
source: Corrects posture and supports muscles
th: แก้ไขท่าทางและรองรับกล้ามเนื้อ

source: Compression Leggings
th: กางเกงกด

# compressionLeggingsDescription
source: Improve blood circulation and muscle tone
th: ปรับปรุงการไหลเวียนเลือดและกล้ามเนื้อ

source: Posture Corset
th: เสื้อคอร์เซ็ตท่าทาง

# postureCorsetDescription
source: Corrects posture and strengthens back
th: แก้ไขท่าทางและเสริมความแข็งแรงของหลัง

source: Sports Bra
th: เสื้อชั้นในกีฬา

# sportsBraDescription
source: Supports chest during workouts
th: รองรับหน้าอกระหว่างออกกำลังกาย

# experimentTitle
source: Muscle Pumping Experiment
th: การทดลองปั๊มกล้ามเนื้อ

source: Start Experiment
th: เริ่มการทดลอง

source: Complete Day
th: เสร็จสิ้นวัน

# experimentProgress
source: Progress
th: ความคืบหน้า

source: Day
th: วัน

# ofText
source: of
th: จาก

source: Muscle Progress
th: ความคืบหน้าของกล้ามเนื้อ

source: Experiment Active
th: การทดลองกำลังดำเนินการ

source: Experiment Inactive
th: การทดลองไม่เริ่มต้น

# daysCompleted
source: Days Completed: {count}
th: วันที่เสร็จสิ้น: {count}

source: Clothing Recommendations
th: คำแนะนำเสื้อผ้า

source: Notes:
th: บันทึก

source: Add Note
th: เพิ่มบันทึก

source: Edit Note
th: แก้ไขบันทึก

# personalInfo
source: Personal Information
th: ข้อมูลส่วนตัว

source: Name
th: ชื่อ

source: Age
th: อายุ

# height
source: Height (cm)
th: ส่วนสูง (ซม.)

# weight
source: Weight (kg)
th: น้ำหนัก (กก.)

source: Gender
th: เพศ

source: Male
th: ชาย

source: Female
th: หญิง

source: Activity Level
th: ระดับกิจกรรม

# lowActivity
source: Low
th: ต่ำ

# highActivity
source: High
th: สูง

source: Progress Metrics
th: ตัวชี้วัดความคืบหน้า

source: Muscle Mass
th: มวลกล้ามเนื้อ

source: Fat Mass
th: มวลไขมัน

source: Grip Strength
th: ความแข็งแรงในการจับ

source: Current
th: ปัจจุบัน

source: Target
th: เป้าหมาย

source: kg
th: กก.

source: cm
th: ซม.

source: years
th: ปี

source: Edit Profile
th: แก้ไขโปรไฟล์

source: Save Changes
th: บันทึกการเปลี่ยนแปลง

source: Reset Progress
th: รีเซ็ตความคืบหน้า

source: Export Data
th: ส่งออกข้อมูล

source: Import Data
th: นำเข้าข้อมูล

source: Delete Account
th: ลบบัญชี

source: Logout
th: ออกจากระบบ

source: Next
th: ถัดไป

source: Previous
th: ก่อนหน้า

source: Skip
th: ข้าม

source: Finish
th: เสร็จสิ้น

# continueButton
source: Continue
th: ดำเนินการต่อ

source: Restart
th: เริ่มใหม่

source: Pause
th: หยุดชั่วคราว

source: Resume
th: ดำเนินการต่อ

source: Select Language
th: เลือกภาษา

# systemLanguage
source: System
th: ระบบ

source: Step
th: ขั้นตอน

# ofLabel
source: of
th: จาก

source: Interactive Hair Model
th: โมเดลขนแบบโต้ตอบ

source: Bulb
th: หัว

source: Roots
th: ราก

source: Hair
th: ขน

source: Nerve-Hair Connection
th: การเชื่อมต่อประสาท-ขน

source: Nerve
th: ประสาท

source: Adaptation Examples
th: ตัวอย่างการปรับตัว

source: Watermelon
th: แตงโม

source: Cube
th: ลูกบาศก์

source: Foot
th: เท้า

source: Tight Shoes
th: รองเท้าคับ

source: Select fitting mode
th: เลือกโหมดการสวมใส่

source: Maximum relaxation
th: การผ่อนคลายสูงสุด

source: Active body work
th: การทำงานของร่างกายอย่างแข็งขัน

source: Body part
th: ส่วนของร่างกาย

source: Shoes
th: รองเท้า

source: Comfortable Clothing
th: เสื้อผ้าสบาย

source: Corrective Clothing
th: เสื้อผ้าแก้ไข

source: Selected Items
th: รายการที่เลือก

source: Comfort
th: ความสบาย

source: Correction
th: การแก้ไข

# experimentGoal
source: Goal: Prove that properly selected clothing can stimulate muscle growth through nerve endings and body hair.
th: เป้าหมาย: พิสูจน์ว่าเสื้อผ้าที่เลือกอย่างเหมาะสมสามารถกระตุ้นการเติบโตของกล้ามเนื้อผ่านปลายประสาทและขนร่างกาย

source: Recommended Clothing:
th: เสื้อผ้าที่แนะนำ:

source: Expected Effect:
th: ผลที่คาดหวัง:

# writeObservations
source: Write your observations...
th: เขียนข้อสังเกตของคุณ...

source: How it works:
th: วิธีการทำงาน:

# step1Description
source: Compression clothing creates pressure on hair follicles
th: เสื้อผ้ากดสร้างแรงกดบนรากขน

# step2Description
source: Nerve endings transmit signals to the brain
th: ปลายประสาทส่งสัญญาณไปยังสมอง

# step3Description
source: Brain adapts anatomy to new "shell"
th: สมองปรับกายวิภาคให้เข้ากับ "เปลือก" ใหม่

# step4Description
source: Result: muscle strengthening and growth
th: ผลลัพธ์: การเสริมความแข็งแรงและการเติบโตของกล้ามเนื้อ

source: ⚠️ Important:
th: ⚠️ สำคัญ:

# experimentWarning
source: The experiment is based on the theory of clothing's influence on anatomy through nerve endings. Results may vary.
th: การทดลองนี้ขึ้นอยู่กับทฤษฎีอิทธิพลของเสื้อผ้าต่อกายวิภาคผ่านปลายประสาท ผลลัพธ์อาจแตกต่างกัน

# initialAdaptation
source: Initial body adaptation to compression clothing
th: การปรับตัวเริ่มต้นของร่างกายต่อเสื้อผ้ากด

# improvedCirculation
source: Improved blood circulation and muscle tone
th: ปรับปรุงการไหลเวียนเลือดและกล้ามเนื้อ

# nerveActivation
source: Nerve ending activation and muscle growth stimulation
th: การกระตุ้นปลายประสาทและการกระตุ้นการเติบโตของกล้ามเนื้อ

# maximumStimulation
source: Maximum stimulation and visible results
th: การกระตุ้นสูงสุดและผลลัพธ์ที่มองเห็นได้

source: User
th: ผู้ใช้

# experimentParticipant
source: Live Skin Experiment Participant
th: ผู้เข้าร่วมการทดลองผิวมีชีวิต

source: Personal Information
th: ข้อมูลส่วนตัว

source: Low
th: ต่ำ

source: Moderate
th: ปานกลาง

source: High
th: สูง

source: Progress
th: ความคืบหน้า

source: Progress: {percent}%
th: ความคืบหน้า: {percent}%

# targetGoal
source: Target: {value} {unit}
th: เป้าหมาย: {value} {unit}

source: Experiment Status
th: สถานะการทดลอง

source: Experiment Not Started
th: การทดลองยังไม่เริ่มต้น

source: Notifications
th: การแจ้งเตือน

# notificationsDescription
source: Receive experiment reminders
th: รับการแจ้งเตือนการทดลอง

source: Auto Save
th: บันทึกอัตโนมัติ

# autoSaveDescription
source: Automatically save progress
th: บันทึกความคืบหน้าอัตโนมัติ

source: Dark Theme
th: ธีมมืด

# darkThemeDescription
source: Use dark theme
th: ใช้ธีมมืด

# exportDataDescription
source: Export experiment data
th: ส่งออกข้อมูลการทดลอง
